
//--створити масив з:
// - з 5 числових значень

const arr1 = [1, 2, 3, 4, 5];

// - з 5 стічкових значень

const arr2 = ['html', 'css', 'js', 'java', 'PHP'];

// - з 5 значень стрічкового, числового та булевого типу

const arr3 = ['car', 'phone', 325, false, true];

// - та вивести його в консоль

console.log(arr1, arr2, arr3);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

const arr = [];
arr[0] = 'djfj';
arr[1] = 12;
arr[2] = 15;
arr[3] = 'kjis'
arr[4] = true

console.log(arr);

// - є масив  :
const namber = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0;
while (i<namber.length) {
    let nam = namber[i];
    console.log(nam);
    i++;
}
// 2. перебрати його циклом for
for (let j = 0; j < namber.length; j++) {
    const namberElement = namber[j];
    console.log(namberElement);
}
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
let a = 0;
while (a<namber.length) {
    let nam = namber[a];
    if (a % 2);
    console.log(nam);
    a++;
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (let j = 0; j < namber.length; j++) {
        if (j % 2) ;{
        console.log(j);
    }
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор