// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    console.log('великий масив, в якому  3 і більше елементи')
}else {
    console.log('маленький масив, в якому менше 3-х елементів')
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//

// let x = +prompt('введіть перше число');
// let y = +prompt('введіть друге число');
// let z = +prompt('введіть третє число');
//
// if (x>y && x<z || x>z && x<y) {
//     console.log(x);
// } else if (y>x && y<z || y>z && y<x) {
//     console.log(y);
// }else if (z>x && z<y || z>y && z<x) {
//     console.log(z);
// } else {
//     console.log('середнього числа не знайдено')
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
let a = 4;
let b = 5;
let result = (a + b < 4)? 'Мало' : 'Багато';
console.log(result);
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//

// function nam (x) {
//
//     if (x === 0 || isNaN(x)) {
//         return x;
//     }
//     return x > 0 ? 1 : -1;
// }
// console.log(nam (-45));

// let nam = +prompt('введіть число від -100 до 100');
// nam < 0 && nam >= -100? console.log('число негативне') :
//     nam > 0 && nam <= 100? console.log('число позитивне'):
//        nam === 0 ? console.log('0') : console.log('введено невірне число');


//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//

let test = false;
test ? console.log('Вірн') : console.log('Неправильно');


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
//
// const ques = prompt('„Яка «офіційна» назва JavaScript?“');
// if (ques === 'ECMAScrip') {
//     console.log('Правильно!')
// }else {
//     console.log('Не знаєте? ECMAScript!')
// }
//
//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// const apt = +prompt('Введіть номер квартири від 1 до 90');
// if (apt >= 1 && apt <= 20) {
//     console.log("Дана квартира знаходиться у першому під'їзді")
// }else  if (apt >20 && apt <= 48) {
//     console.log("Дана квартира знаходиться у другому під'їзді")
// }else  if (apt >48 && apt <= 60) {
//     console.log("Дана квартира знаходиться у третьому під'їзді")
// }else {
//     console.log('Даної квартири нема у цьому будинку')
// }

//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

const number = 0;
if (number === 10) {
    console.log('ВІРНО')
}else {
    console.log('НЕВІРНО')
}

//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

const temp =18;
temp >=10 && temp <= 22? console.log('йдемо ВЧИТИСЯ') : console.log('сидимо вдома і вчимося ОНЛАЙН');

//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
const namber = +prompt('Введіть довільне число');
switch (namber) {
    case 1:
        console.log('Вітаємо ! Ви виграли авто !!!')
        break;
    case 2:
        console.log('Вітаємо ! Ви виграли мото !!!')
        break;
    case 3:
        console.log('Вітаємо ! Ви виграли телефон !!!')
        break;
    case 4:
        console.log('Вітаємо ! Ви виграли телевізор !!!')
        break;
    case 5:
        console.log('Вітаємо ! Ви виграли ноутбук !!!')
        break;
    default:
        console.log('число не вірне ...')
}